src/CFD/pipe_validation_refine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          240;
        startFace       11256;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          240;
        startFace       11496;
    }
    inlet
    {
        type            patch;
        nFaces          24;
        startFace       11736;
    }
    outlet
    {
        type            patch;
        nFaces          24;
        startFace       11760;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          11520;
        startFace       11784;
    }
)

// ************************************************************************* //
