src/CFD/pipe_validation_refine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0.15)
    (18 0 -0.15)
    (18 0.2 -0.15)
    (0 0.2 -0.15)
    (0 0 0)
    (18 0 0)
    (18 0.2 0)
    (0 0.2 0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (240 24 1)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    upperWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
